---
kind: method
id: M:Autodesk.Revit.UI.Macros.DocumentEntryPoint.OnShutdownEO
source: html/4b325bc5-02e4-0c8a-b835-c87089592a53.htm
---
# Autodesk.Revit.UI.Macros.DocumentEntryPoint.OnShutdownEO Method

For Revit Macros internal use only.

## Syntax (C#)
```csharp
public void OnShutdownEO()
```